<template>
  <section v-if="$i18n.locale === 'uk-UA'" id="how-it-works" class="my-4">
    <div class="row">
      <div class="col">
        <h2>{{ $t('howItWorks') }}</h2>
      </div>
    </div>

    <div class="row">
      <div class="col">
        <div class="mt-3">
          <p>
            Бібліотека використовує більше вісімдесяти правил для відмінювання прізвищ, імен та по
            батькові. Правила фільтруються за родом, закінченням, частиною мови, сферою застосування
            та сортуються за пріоритетом.
          </p>

          <p>
            При відмінюванні жіночих прізвищ із закінченнями на -а, -я та чоловічих прізвищ із
            закінченнями на -ой, -ій, -ий, -их для визначення частини мови слова використовуються
            нейронні мережі, навчені на більш як сорока тисячах прізвищах. Тому прізвища
            іменникового та прикметникового походжень відмінюються як іменники та прикметники
            відповідно, наприклад, Диня (називний) &rarr; Дині (родовий), Синя (називний) &rarr;
            Синьої (родовий), Рий (називний) &rarr; Рия (родовий), Бурий (називний) &rarr; Бурого
            (родовий).
          </p>

          <p>
            При відмінюванні відбуваються зміни голосних та приголосних звуків згідно з правилами
            української мови, наприклад, Сивокінь (називний) &rarr; Сивоконя (родовий), Гичка
            (називний) &rarr; Гичці (давальний), але Чміль (називний) &rarr; Чміля (родовий).
          </p>

          <p>
            Складені прізвища, утворені поєднанням двох самостійних прізвищ відмінюються за
            правилами відмінювання кожної складової частини, наприклад, Нечуй-Левицький (називний) -
            Нечуя-Левицького (родовий), але Драй-Хмара (називний) - Драй-Хмари (родовий), бо перша
            коротка частина складеного прізвища є односкладовою та сприймається не як самостійне
            прізвище, а як приставка до другого компонента.
          </p>

          <p>
            Складені імена, утворені поєднанням двох самостійних імен відмінюються згідно з
            правилами відмінювання кожної складової частини, наприклад, Анна-Марія (називний) -
            Анни-Марії (родовий).
          </p>
        </div>
      </div>
    </div>
  </section>
</template>
