{
  "modelInfo": {"dateSaved":"2023-02-16T00:14:42.753Z","modelTopologyType":"JSON","modelTopologyBytes":1659,"weightSpecsBytes":428,"weightDataBytes":4356},
  "modelMetadata": {"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null},
  "modelTopology": {"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Embedding","config":{"input_dim":34,"output_dim":16,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,null]}},{"class_name":"SimpleRNN","config":{"name":"simple_rnn_SimpleRNN1","trainable":true,"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},
  "weightSpecs": [{"name":"embedding_Embedding1/embeddings","shape":[34,16],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN1/kernel","shape":[16,16],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN1/recurrent_kernel","shape":[16,16],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN1/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1],"dtype":"float32"}],
  "weightData": "Rev2O4TTez1kUwc88DqSvNfOwbwpkKa968xWvRNKmr2N4+A8hyCoPY6JdL3vIBs9qHocvU8CGT17MHS7HhBEPKUmuL3r0yY+aEMgPlNqtr4pr2e9M7vSvNTd4zxNxx4+LQ8LPuaMxLzwOrk9RC9EPFuAP73UrYG+b92fPhBUSj1cUfc9/ndWvsEEGb0RBXA+QhOjPByI1D1vhl4+LoeyvZ7vyL0TDXs91DjUvUTsDT65EvE9dIFlPvW0jr7cSJg9IXfivds5Wj532Bg+pMwTvmfIT72XqOK9i8wzvklY4z1bQ2k+hPk1vrsK1z36Mzm+FXuHPf1IB75bUEs+8uJrvpF3ND4MPdK9nOM1PWNHVz4v+mI+ErWJPdJBQD5bf5y+8X9ovVknEz6rQD2+IF+SPenzGD5+p2M+dJluvnAnGz5gEIO9qj0WPVSooz3Y14i828MVPvTcJ7yenHw8VqWjPRbm77xfGps8SdZEvRTk7T0PykI8U7O/Pcd+3L0a8Rk+vpoqPm6CA75k6+q9aAx4PtqgST1iqyc++Xs2Pv2mHL74lBO+1Y5iPvJiQ75R6zo+AdYZPmvdWD41SYK+5yUoPqRQVb18txu+Yx7MPb72rb2CIA+99/RavS5JAz4ZFQU98KCnvbstFL2sraq8VI0YvVMQk70ssbK96HoHvJrmiz2wE0I+Ce/1PVcAlz3vcoQ+G4LoPNF/dj4d6V0+924Uvm3RLT4sWJq9gCsPvohYkL6ahkg+KQTzPRmHeT2WMY++BnmUPcTUgL0zAsE9ZQzuuzxqW70vaKs95W8WPsQ1RD2d9tM9uTbAvXOJ3zu64PG9ekjgPcNunzt/kE49Irsjvpgb/j2I6YG+N0ziPS6QGj7iLn09kQpCPiszHD5b9x++ldD7vYSdPLxWqoO8M7YrvRxJsj2o1iI9EdGVvlLSxDyo1ka+Vv7lPWEyJD21wT6+KakBvoXmGL5EtyC+incKPr1Ppz3qmGq+FwElPrnUGL66ubq9inZDviw1BD5oegC+GXXpPZDBCLxPEgG7OVB4PgF3+T1qMhY+skYqPkKMLr5rfXo9oNcQPhcldb42CyS9GXgFPsUoYz7yXxK+zCD+Pcy9OzxkM7w9c0TgPUEA8zsY8rc9tz7vPB1k2T1VFYm9L99uPZuaB7y+/oS996PCvb6NlT3mRTe8zJrsvT00I702tRs9Oji4PEM9nT2TiBS+xBMivuYSoT3ZMEA9xjfsPHtGib45f/Q9ajTAvRzGBT6t/V29xQwIvn7fjj3ZNuE9nXVHPnnFkL3KRdS9caV5PnEQdD2vlqY9v8V9PcfmDL5FviC8hLFUPbxGdr0gKZk9x4LEPIktdT4MLta9Hh/6PCXFYD0F3R++deDEPVQ3WDxz14k9pp6XPQxr8z00AIi8SPCDvWc/P73KlNu9xBAWvX44+zxE61k9+/v7vaK56T2ePSE+YFPsvTdkmzySGg4+9qqXPfLjKz1iJBQ8TrxKvoiAQL0j+0s+PMOGvYSb7T0IW0G98A1hPlIbhb7w5jU9EnO+vUSjcz4xats9aUMyvoBhvjwAsPO85vaCupusBj452o0+2itPvh8bIj0cvCO+1GAuPg/SJr5PzTo+anI6vm6EU7pGViM8vfG4PWxVI7z8QTU9sSqyPeXCBD6mfpW8yw+1PXkyDb54XZG9ABuRvR8d8j2fP8M8srfEPep3GD16Kbk9LEXZvTxtVDyCRFI+QeW/Pfr78T1jZqg9iuQ1vtsEKr5nlik+q+73vDGH+T0b3wU9bqFnPt+XWL4nzQw+qAH7PfVfZ74anRo8fnknPoMOhD3Nouw9IdZZPfHoC759Eeu9ssHhPVPQ0713TbI9Tn0QvqhiBD420HW+dYQEPgc+jD5fyvK8AGvQvT+RCz6DR4e+KTlPPpwa+j2mT0a+b5H/PbCIFj3a5JK8aP9FviBUoD1w8mS9fp7YPdcAZr40VxA8Bs3qvZBW2DudUEu8ffEEvabI2jxdYoY9DNJDvbBE4rz/N+a8voOvvWpUqDt7ZYE91Fq1PJIxx70X1YQ9SP6ZvOtHKb49dag9DJbkvcaojr1AVBY8+63Su0cKSj5yqPm8hFUrvuD06T3uriW+dLqSvTHTGr6fTiW8mvYrvhJlqz0Wxle+fJCSvcp8Dz53F5S9lxIhPcnwiD3/nTI8TJD8vVOcBbzcGnS+3AKUPY4YKj161R4+Ey7VvWCaBT5WT409aX5Kvk9OAT3kIpk+/RjiOwVlzT3z9Qc+rTWzvRI/4L368jo989upvaqR8DujUQM++FUbPjaPm77EARQ9pjOaPna3Vb5MPWy+T9KTPjCgVb7YBH0+wKAdPoV4gL5JkDq+FyiaPh5frL0COxS+oTD6PWjQMj5i7k6+5aVOvr0nNT3AdY28FLG2PEOfRbxTLaC9fRDUPROX1j2/crY9rnzhPGKGh73IF489JFcUvsq4DT1Cdm29W/ALPbLbOb2Ht0M+prpKvtqFkL3kbkc+rKA5vmEkCT5JMg8+KL7jvVJvBL44RJU9MWI2PRHOCr5Hw4q8gAUAvaXPFL4cUBq98gkLPYqjDT3yrhk+Z/SvvZQr9L28ZZY94B3CPQleIT5O32U+mJecvrggID4iLHa+XftoPevPVb63zQM+zzVAvuCr+T1GL48+8lbjvR6CeD5liEE+MHdnPpm8gz5GPES+emyMPmZQ1T0bpIO+zqIbPce7mT5/mrE+eKgOPijkUr0u1Jy93m/fvVFwSz4uLzq+EYMFvWYAAr6GoDK8Z4sdPoAl2r04LhW9HRAEPpYuor1MTiK+k79jvixNK76eCSQ9sU1/vjGACD35B0G+qHfWPs8M5j2sPWW+LMetuycyoT41JLI+PfDLvnx8yDorBTu+rHEJPVeO3z1cM3C+zpWqvm+Ghz19iza8zgEFv1yXLz8zcMy+vzdfPAtYOL5SEHw+PRPsvvjL1rzNX1A+bbLMvidOi77dOkS+EbFyvqbTOD/6mlk+3zfvPiADITzlzwy/ZxaUvpZD/jxPbco+IqnHPuIMrD5oISQ+REGmPu5HbDzLyLm+R1NzPcWdFj641b++L0jGPq78vz6E5hm+i+APvfb4hz7Qlxo/vZy7vOwRCr88Alq+8npFvaeaQb36LIi9uk2rvSoy7T2DmJE+eeohv9AShj1q9gC/sbDIvs11tj613Ak/v/ytvlvpEr4j86c9jSgsPNNt5D41SwM/CW2XvlYMbD7sktC+rhYmvl5RHj+ZOTw+emlovi5+hr65FqW+qTS1PRc0TL1VevS+TTkKvsLtuz4ebtY+FhtTvpaHLT7CdDa+qqsPvqqbor5myNS7+/K8vTHeYT5+kf69AJWQPi85Bb48gb49BAqUvpS2Az9A6Iq+3j0yPvXpgL31VwI9YUvpPWDTK75n4qi+E4IrPqNX4T5QNHc+x66Pvrr+9j7e2TW98Drzvb/i5b4X+JA+v3ocvsgS4D0v3gk/louUvvjeZD4XhLa95Zzsvivghr7O0eq+FHuvPiLVLj7NpN6+/r+Yvuk6NL7zlII9XFH9vmickb6lH927xw77PkR3RT4ocx8+OLnvPPhQV736L6G+MbPbPc9TPT4MBzQ981Oovg7Rwj087r08fnTLPnXCor2fQU++BMQ6P7CVXDzWF2u+4UUYvqWb1zy2maC+Z4GNvlwFhT6vhMU8cbmEvAe7Tzxq10++l831PZ2mrL6GJd0+dHjAu4gcar5+MJs82e5avsgRFr4WEbq+t4z6Pg2t/D2Glwq/VuzAvas/nL1DNSm+M3S1PgKqoz7qr5Y8a8bkvWb1XDypqI69yD/Evmf2Vj7ns+Y6SDmDvilrmD32Yae+UKqnPlGOGz7LLcC9nXk+vvqJaj4J6BO/cpRhvpHI3L6D3dk9aHbKPSKZWz6Fvs4+LxJLO5hhHLwNjKo+pg8KP9Kgjz5nCQ4+z5C6vRmXYr7yq44+r+n+PGYLTL5Grx4/UabcvVPpoj4NsxE+o8CEvkrToj4L0za+tM2UvoA5PL4Vduo+TP6lvuRiMb8yKN+8qPCsvC+1yL6gMXu+GKQAP7J86r3H8wI/nm+sPq0Aur3RD9E91hECvrbuMb2FsXs+pDyXvoUb7D7eZAQ/EFcTvzcVP75xTUO+JPrPPjw6gD6Jbm6+PXZBvdGjBL/aVPU8m87Uvv4wzz0uzFW+jz/kvp4OJDqZECc+aeVDPtFRiD5yGqa8MyMGvjXEJr94heC83km0PtL2iL0UCr49yEwIP8ZARr6a69E+ChgHP2qcPD5s/qa+SdKrvaqNlT5SKze+vfkYPquD1D4cZYY+83RbPby2gTyACBe+yPeKPl2X7D4iLc09tvGSvjnJK7621oo9O+rPPTDNoj6mXco9QI1ePq+KLj6dPc4+pwsrPennJr7RaOa74uVqPa/31r5frrY9OhD/vscGAT/y7l++yi9GvcoEtD7EEao+e4VfPQoRlj6kRso+2ezyPcWeEb6DGuA93ajqvpyp8z3u1kU+3Q9ZPhoYTr1LDaM9djwgP7Y2mT3hdm0+5Fa5vqFhi74bpu29UJ2iPmxl9TwyGd0+F0XfOtiw671Cg+M+4EVyPhFssL2SVIc+P2hovX8jAb8sT0g+J9cBPo4/GD76JBi+YPfBPkdEK76oyQ28uGEsPU4w1b5CI5A+AsUQPrFZnb0vWDw956K0PkzExb7/uga95h2Kvki2Rr6bLH8+XM7lvTwD/z7WSSU9AymmPmsftD4gvq0+M5xQPjYCNz1W04Y+KQd4vkapbj4xzb0+X/ChPcBoZD7Zr6o+aHgrP0v6f73KNVm+bVBMvj4pnT1Yszk+uk7mPuL3mT1YKLO7vs26vpbPeT4mHoU91JAdvUWMgz3PHYQ+44DNvRgUVz48p5A+fWu9vvvZw74nip09WiCoPqlj0r6zKlw9150jP9IIRj7jU7m9FMLmvKmIZz64JSI+uBDRPbp9hj7nQLG+1YTbPmqpx7tHirs9FFBrPiKjIT7Ljbe9iXYZPgK3Ar7qKsO+Bj5nvmVfWz66AdA8oUidPrIyiz653sw9UNmiPm1OuT5icEK+/qfOPf0sJb6K2Cc/2nyYvuPJAb5XwZO+unOPPmAQlb3WqKo9AsmbPvQTar5sLty+Bc5FPpRQPj60X3A+/BULPuL56j2mP9I8pWC9vLWnmL6HWdM+MkuBPMSA9j4E6oi+i9FNvnyikL4N1Y2+vuGwPlIFFT7lH4C83H9hPbUvbzykqLG9MQ38vRyFI79ZLvW9Chr7POaTJr5bAyQ+DlzWPip4uD7Dds8+GA2Pvfuvuz5u3JG+0ccTvNbU9710QGu+U21iPg2+HD7t1V++J38PPtCkyT4fIog957lUPuePxL6jwnE+6YYivmUnzbzZnQi+u1fvPrzNaL3NIIC+oJqaPAyq3b60POQ+7MvlPYSzHTgX0yE5d3ehvg0Eoj5PLqg9prQ+vqj8ED4hj5A+cboOvqsUkb5mo0e+UFifvoB8Gz20dnA94yMJv8Xodz2qd6S9w8mWPRKBhL5WYii936hRPQ8frr51WgO+k/mJPhEutD4lUxo+ZNymvhrPjT68bGs9cpM7u4tlZ771vnU+2nFrPn0AHD+Tdb8+nYMcPrx21z5sUxK+C4fYPf6ZXD1rMWy+aqQlPTPgkD09ZIg9MDp/PcqDXL0R9aU9XqdoPWEQyT0D9lu9FcO8PRrJ9DwIOY69B2JPvYDFDz0+uG68otIsvZsEob6X3zC/QJaMPjIHt77nx2A8hkmDvshTuT4IGsi+hkTHPrjHWz95tTM/zsQcvI1Q0z7L31m+yhsAv1PRRr0KiwC9"
}