<script setup lang="ts">
import { computed } from 'vue';
import Showdown from 'showdown';

const appConfig = useAppConfig();
const converter = new Showdown.Converter();

const { data } = await useFetch<string>(appConfig.library.howItWorksUrl, {
  server: true,
});

/**
 * Static copy of the wiki page until https://github.com/orgs/community/discussions/46758#discussioncomment-4950782 is fixed.
 */
const staticContents = `
Бібліотека містить понад вісімдесят граматичних правил для відмінювання прізвищ, імен та по батькові. Належне правило обирається за граматичним відмінком, родом, закінченням слова, частиною мови, сферою застосування та пріоритетом.

При відмінюванні жіночих прізвищ із закінченнями на -**а**, -**я** та чоловічих прізвищ із закінченнями на -**ой**, -**ій**, -**ий**, -**их** для класифікації прізвищ іменникового та прикметникового походження використовуються модель машинного навчання, навчена на більш як сорока тисячах прізвищах. Тому прізвища іменникового та прикметникового походжень відмінюються як іменники та прикметники відповідно: Дин**я** (називний) → Дин**і** (родовий), Син**я** (називний) → Син**ьої** (родовий), Р**ий** (називний) → Ри**я** (родовий), Бур**ий** (називний) → Бур**ого** (родовий).

При відмінюванні відбуваються зміни голосних та приголосних звуків згідно з правилами української мови: Сивок**і**нь (називний) → Сивок**о**ня (родовий), Гич**ка** (називний) → Гич**ці** (давальний).

Складні імена та прізвища, утворені поєднанням двох самостійних частин відмінюються за правилами відмінювання кожної складової частини: Анн**а**-Марі**я** (називний) → Анн**и**-Марі**ї** (родовий), Нечу**й**-Левицьк**ий** (називний) → Нечу**я**-Левицьк**ого** (родовий). Але коли перша частина прізвища — односкладове слово, то відмінюється, як правило, лише друга частина: Дра**й**-Хмар**а** (називний) → Дра**й**-Хмар**и** (родовий).

Враховано особливості нового українського правопису (редакція 2019 року): Ігор (називний) → Ігор**я** (родовий).
`;

const contents = computed(() => {
  if (staticContents) {
    return converter.makeHtml(staticContents);
  }

  if (data.value == null) {
    return '';
  }

  return converter.makeHtml(data.value);
});
</script>

<template>
  <section v-if="$i18n.locale === 'uk-UA'" id="how-it-works" class="my-4">
    <div class="row">
      <div class="col">
        <h2>{{ $t('howItWorks') }}</h2>
      </div>
    </div>

    <div class="row">
      <div class="col">
        <div v-html="contents" class="mt-3"></div>
      </div>
    </div>
  </section>
</template>
